Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
import pandas as pd
data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
variable print it

In [4]:
import pandas as pd

list = [1,2,3,4,5,6,7,8,9,10]
series = pd.Series(list)
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame.

In [8]:
import pandas as pd

data = {
    'Name' : ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [10]:
## DataFrame:- In Pandas, a DataFrame is a two-dimensional labeled data structure that represents a tabular, spreadsheet-like data object. 
#It consists of rows and columns, where each column can contain different data types (e.g., numbers, strings, etc.).

## Series :- a Pandas Series is a one-dimensional labeled array capable of holding any data type. 

# difference :- A DataFrame is a two-dimensional structure with rows and columns, while a Series is a one-dimensional object representing a single column.

## Examples :-

import pandas as pd

# Example DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

df = pd.DataFrame(data)

# Example Series
names = pd.Series(['Alice', 'Bob', 'Claire'])

In [11]:
data

{'Name': ['Alice', 'Bob', 'Claire'],
 'Age': [25, 30, 27],
 'Gender': ['Female', 'Male', 'Female']}

In [12]:
names

0     Alice
1       Bob
2    Claire
dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can 
you give an example of when you might use one of these functions?

In [15]:
## Head()  Function

import pandas as pd


data = {
    'Name': ['Alice', 'Bob', 'Claire', 'David', 'Emily'],
    'Age': [25, 30, 27, 35, 29],
    'Gender': ['Female', 'Male', 'Female', 'Male', 'Female']
}

df = pd.DataFrame(data)
df.head(3)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [16]:
## Describe() function

import pandas as pd


data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Salary': [50000, 70000, 60000]
}

df = pd.DataFrame(data)

df.describe()

             Age   Salary
count   3.000000      3.0
mean   27.333333  60000.0
std     2.516611  10000.0
min    25.000000  50000.0
25%    26.000000  55000.0
50%    27.000000  60000.0
75%    28.500000  65000.0
max    30.000000  70000.0

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [17]:
## In Pandas, both Series and DataFrame are mutable in nature, while Panel is deprecated

Q7. Create a DataFrame using multiple Series. Explain with an example

In [19]:
import pandas as pd


name_series = pd.Series(['Alice', 'Bob', 'Claire'])
age_series = pd.Series([25, 30, 27])
gender_series = pd.Series(['Female', 'Male', 'Female'])


df = pd.DataFrame({
    'Name': name_series,
    'Age': age_series,
    'Gender': gender_series
})

df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female